using System;

namespace Exercise3._1._3
{                                      //ВЫПОЛНЯЕТСЯ 
    class Program
    {
        /*                                        ____________________Задание №3.1.3____________________
      Даны заданное слово и непустая последовательность слов (одномерный символьный массив): между словами запятые или пробелы, в конце точка.
      В словах могут встретиться ошибки – переставлены две соседние буквы, заменена одна буква, пропущена одна буква. Требуется найти в 
      последовательности слов все слова, из которых могло бы получиться заданное слово в результате одной ошибки. Не использовать строковые функции
        */

       
       
    }


}